{
  "intents": [
      {
          "tag": "ทักทาย",
          "patterns": [
              "สวัสดี",
              "สบายดีไหม",
              "มีใครอยู่ไหม",
              "สวัสดีครับ",
              "สวัสดีค่ะ",
              "ดีจังที่ได้เจอคุณ",
              "วันนี้อากาศดีนะ",
              "สวัสดีตอนเช้า"
          ],
          "responses": [
              "สวัสดีค่ะ!",
              "ดีใจที่ได้เจอคุณ!",
              "สวัสดีค่ะ มีอะไรให้ช่วยเหลือคะ?",
              "สวัสดีครับ ยินดีที่ได้พบคุณ!"
          ],
          "context_set": ""
      },
      {
          "tag": "ลาก่อน",
          "patterns": [
              "ลาก่อน",
              "บ๊ายบาย",
              "เจอกันใหม่",
              "ผมจะไปแล้ว",
              "ขอให้มีวันที่ดี",
              "ไว้เจอกัน",
              "เดี๋ยวเจอกัน"
          ],
          "responses": [
              "ลาก่อนค่ะ เจอกันใหม่!",
              "ไว้เจอกันใหม่นะคะ!",
              "บ๊ายบายค่ะ!",
              "ขอให้มีวันที่ดีนะ!"
          ],
          "context_set": ""
      },
      {
          "tag": "ขอบคุณ",
          "patterns": [
              "ขอบคุณ",
              "ขอบคุณมาก",
              "ขอบใจนะ",
              "ขอบคุณสำหรับความช่วยเหลือ",
              "ขอบคุณค่ะ",
              "ขอบคุณครับ"
          ],
          "responses": [
              "ยินดีค่ะ!",
              "ด้วยความยินดีค่ะ!",
              "ไม่เป็นไรค่ะ!",
              "ยินดีเสมอค่ะ!"
          ],
          "context_set": ""
      },
      {
          "tag": "คำถามเรื่องอายุ",
          "patterns": [
              "คุณอายุเท่าไหร่",
              "คุณเกิดเมื่อไหร่",
              "คุณแก่ไหม",
              "คุณอายุเท่าไหร่แล้ว",
              "บอกอายุของคุณให้ฟังหน่อย"
          ],
          "responses": [
              "ฉันถูกสร้างขึ้นในปี 2022!",
              "อายุของฉันขึ้นอยู่กับโปรแกรมที่คุณใช้อยู่",
              "ฉันไม่มีอายุเหมือนมนุษย์ค่ะ!"
          ],
          "context_set": ""
      },
      {
          "tag": "การพยากรณ์อากาศ",
          "patterns": [
              "สภาพอากาศวันนี้เป็นอย่างไร",
              "ฝนจะตกไหมวันนี้",
              "วันนี้อากาศดีไหม",
              "ช่วยบอกสภาพอากาศหน่อย",
              "วันนี้จะมีแดดไหม"
          ],
          "responses": [
              "ขอเวลาสักครู่ ฉันจะตรวจสอบสภาพอากาศให้ค่ะ",
              "ตอนนี้ฉันไม่สามารถตรวจสอบอากาศได้ แต่คุณสามารถเช็คที่เว็บไซต์สภาพอากาศได้ค่ะ"
          ],
          "context_set": ""
      },
      {
          "tag": "ขอเรื่องตลก",
          "patterns": [
              "เล่าเรื่องตลกให้ฟังหน่อย",
              "มีเรื่องตลกอะไรบ้าง",
              "ช่วยทำให้ฉันหัวเราะหน่อย",
              "อยากฟังเรื่องตลก",
              "เล่าเรื่องขำๆ ให้ฟังหน่อย"
          ],
          "responses": [
              "หมาถามหาคำว่าอะไร?",
              "อะไรที่เป็นสีแดงและยิ้มได้? สตอเบอรี่!",
              "รู้ไหมว่านาฬิกาไม่มีวันหยุดเดิน? เพราะมัน 'เดิน' ตลอดเวลา!",
              "ถ้าแมวชอบนอน ที่ไหนเป็นที่นอนที่ดีที่สุด? บนคีย์บอร์ด!"
          ],
          "context_set": ""
      },
      {
          "tag": "โปรแกรมมิ่ง",
          "patterns": [
              "โปรแกรมมิ่งคืออะไร",
              "การเขียนโปรแกรมคืออะไร",
              "บอกฉันเกี่ยวกับการเขียนโค้ด",
              "การพัฒนาซอฟต์แวร์คืออะไร",
              "โปรแกรมเมอร์ทำอะไร"
          ],
          "responses": [
              "การเขียนโปรแกรมคือการเขียนโค้ดเพื่อให้คอมพิวเตอร์ทำงานตามที่เราต้องการ",
              "การพัฒนาซอฟต์แวร์เป็นกระบวนการที่ทำให้คอมพิวเตอร์สามารถทำงานได้ตามที่ออกแบบไว้"
          ],
          "context_set": ""
      },
      {
          "tag": "เปิดเพลง",
          "patterns": [
              "เปิดเพลงให้ฟังหน่อย",
              "ฉันอยากฟังเพลง",
              "เปิดเพลงในคอมพิวเตอร์",
              "เล่นเพลงในยูทูป",
              "เปิดเพลงในยูทูป",
              "เปิดเพลงในเครื่องนี้"
          ],
          "responses": [
              "ขอโทษค่ะ ฉันไม่สามารถเปิดเพลงได้ในขณะนี้",
              "คุณสามารถเปิดเพลงได้จากแอปพลิเคชันที่คุณใช้ประจำค่ะ",
              "ลองใช้คำสั่ง 'เล่นเพลง' ในแอปของคุณค่ะ"
          ],
          "context_set": ""
      },
      {
          "tag": "ค้นหา",
          "patterns": [
              "ช่วยค้นหาหน่อย",
              "ค้นหาในกูเกิล",
              "ค้นหาข้อมูลนี้",
              "ช่วยค้นหาในอินเทอร์เน็ต",
              "ค้นหาบนกูเกิล"
          ],
          "responses": [
              "ขอโทษค่ะ ฉันไม่สามารถค้นหาข้อมูลในขณะนี้ แต่คุณสามารถใช้กูเกิลได้ค่ะ",
              "ลองค้นหาด้วยแอปพลิเคชันหรือเบราว์เซอร์ที่คุณมีค่ะ"
          ],
          "context_set": ""
      },
      {
          "tag": "ทักทายตอนเช้า",
          "patterns": [
              "สวัสดีตอนเช้า",
              "อรุณสวัสดิ์",
              "สวัสดีเช้าวันใหม่",
              "เช้านี้ดีจัง",
              "อรุณสวัสดิ์ครับ",
              "อรุณสวัสดิ์ค่ะ"
          ],
          "responses": [
              "อรุณสวัสดิ์ค่ะ! หวังว่าคุณจะมีวันที่ดีนะคะ",
              "สวัสดีตอนเช้าค่ะ! มีอะไรให้ช่วยเหลือไหมคะ?",
              "สวัสดีเช้าวันใหม่! มีอะไรให้ฉันช่วยบ้างไหมคะ?"
          ],
          "context_set": ""
      },
      {
          "tag": "สุขภาพ",
          "patterns": [
              "สุขภาพดีไหม",
              "ดูแลสุขภาพยังไง",
              "มีเคล็ดลับดูแลสุขภาพไหม",
              "สุขภาพดีคืออะไร",
              "แนะนำวิธีดูแลสุขภาพหน่อย"
          ],
          "responses": [
              "การดูแลสุขภาพที่ดีคือการออกกำลังกายสม่ำเสมอ กินอาหารที่มีประโยชน์ และพักผ่อนให้เพียงพอค่ะ",
              "สุขภาพดีมาจากการดูแลตนเองอย่างสมดุลทั้งกายและใจค่ะ",
              "คุณควรดื่มน้ำมากๆ และหลีกเลี่ยงอาหารที่มีไขมันสูงค่ะ"
          ],
          "context_set": ""
      },
      {
        "tag": "ปลอบกำลังใจ",
        "patterns": [
            "ฉันรู้สึกเหนื่อย",
            "ฉันยังดีไม่พอ",
            "วันนี้ไม่เป็นดั่งใจเลย",
            "เหนื่อยแล้ว",
            "ฉันผิดหวังกับตัวเอง",
            "ฉันคงทำให้ดีกว่านี้ไม่ได้หรอก",
            "ฉันไม่เก่งเลย",
            "ฉันเศร้า",
            "เครียดเหลือเกิน",
            "พอแล้ว",
            "ไม่อยากจะทำอะไรอีกแล้ว",
            "ท้อจังเลย"
        ],
        "responses": [
            "คุณทำดีที่สุดแล้ว",
            "ไม่เป็นไร ฉันรู้ว่าคุณทำได้",
            "เข้มแข็งไว้นะ!",
            "ทุกคนสามารถล้มเหลวกันได้ ฉันรู้ว่าคุณจะผ่านมันไปได้",
            "คุณทำได้ ฉันเชื่อในตัวคุณนะ",
            "สู้ๆ ทำเต็มที่แล้วไม่เป็นไร เอาใหม่นะ"

        ],
        "context_set": ""
    }
  ]
}
